{
    "anagraphic":{
        "fullname":{
            "first": "Federico",
            "middle": "Andrea",
            "last": "Galatolo"
        },
        "borndate":{
            "day": 25,
            "month": 3,
            "year": 1993
        },
        "nationality": "Italian",
        "picture": "https://via.placeholder.com/250",
        "bio": "Very long description, Very long description, Very long description, Very long description, Very long description, Very long description, Very long description, Very long description, Very long description, Very long description, Very long description, Very long description, Very long description, Very long description, Very long description, Very long description, ",
        "qualifications": ["PhD Student", "Machine Learning Engineer", "Computer Engineer", "Open Source Enthusiast"]
    },
    "digitalidentity":{
        "telephone": "+390502217454",
        "website": "https://galatolo.me",
        "email": "federico.galatolo@ing.unipi.it",
        "profiles":[
            {
                "platform": "GitHub",
                "link": "https://github.com/galatolofederico",
                "icon": "github"
            },
            {
                "platform": "LinkedIn",
                "link": "https://www.linkedin.com/in/galatolo/",
                "icon": "linkedin"
            },
            {
                "platform": "Instagram",
                "link": "https://www.instagram.com/notsosocial/",
                "icon": "instagram"   
            },
            {
                "platform": "Telegram",
                "link": "https://telegram.me/galatolo",
                "icon": "telegram"
            }
        ]
    },
    "publications":[
        {
            "title": "Spikiness Assessment of Term Occurrences in Microblogs: an Approach Based on Computational Stigmergy",
            "authors": "Mario G. C. A. Cimino, Federico Galatolo, Alessandro Lazzeri, Witold Pedrycz, Gigliola Vaglini",
            "date": {
                "day": 17,
                "month": 5,
                "year": 2017
            },
            "type": "conference",
            "container": "Proceedings of the 6th International Conference on Pattern Recognition Applications and Methods - Volume 1: ICPRAM",
            "keywords": ["stigmerigy", "artificial inteligence"],
            "afferences": ["unipi"],
            "volume" : "",
            "issue": "",
            "pages": "731-737",
            "issn": "",
            "isbn": "978-989-758-222-6",
            "doi": "10.5220/0006253807310737",
            "link": "http://www.iet.unipi.it/m.cimino/publications/cimino_pub50.pdf",
            "abstract": "A significant phenomenon in microblogging is that certain occurrences of terms self-produce increasing mentions in the unfolding event. In contrast, other terms manifest a spike for each moment of interest, resulting in a wake-up-and-sleep dynamic. Since spike morphology and background vary widely between events, to detect spikes in microblogs is a challenge. Another way is to detect the spikiness feature rather than spikes. We present an approach which detects and aggregates spikiness contributions by combination of spike patterns, called archetypes. The soft similarity between each archetype and the time series of term occurrences is based on computational stigmergy, a bio-inspired scalar and temporal aggregation of samples. Archetypes are arranged into an architectural module called Stigmergic Receptive Field (SRF). The final spikiness indicator is computed through linear combination of SRFs, whose weights are determined with the Least Square Error minimization on a spikiness training set. The structural parameters of the SRFs are instead determined with the Differential Evolution algorithm, minimizing the error on a training set of archetypal series. Experimental studies have generated a spikiness indicator in a real-world scenario. The indicator has enhanced a cloud representation of social discussion topics, where the more spiky cloud terms are more blurred.",
            "name": "spikiness_2017"
        },
        {
            "title": "Using stigmergy to incorporate the time into artificial neural networks",
            "authors": "Federico A. Galatolo, Mario G.C.A. Cimino, Gigliola Vaglini",
            "date": {
                "day": 21,
                "month": 12,
                "year": 2018
            },
            "type": "conference",
            "container": "MIKE 2018: Mining Intelligence and Knowledge Exploration ",
            "keywords": ["stigmerigy", "artificial inteligence", "neural networks"],
            "afferences": ["unipi"],
            "volume" : "Lecture Notes in Computer Science 11308",
            "issue": "",
            "pages": "248-258",
            "issn": "",
            "isbn": "",
            "doi": "10.1007/978-3-030-05918-7_22",
            "link": "http://www.iet.unipi.it/m.cimino/publications/cimino_pub62.pdf",
            "abstract": "A current research trend in neurocomputing involves the design of novel artificial neural networks incorporating the concept of time into their operating model. In this paper, a novel architecture that employs stigmergy is proposed. Computational stigmergy is used to dynamically increase (or decrease) the strength of a connection, or the activation level, of an artificial neuron when stimulated (or released). This study lays down a basic framework for the derivation of a stigmergic NN with a related training algorithm. To show its potential, some pilot experiments have been reported. The XOR problem is solved by using only one single stigmergic neuron with one input and one output. A static NN, a stigmergic NN, a recurrent NN and a long short-term memory NN have been trained to solve the MNIST digits recognition benchmark.",
            "name": "galatolosnn"
        },
        {
            "title": "Using stigmergy as a computational memory in the design of recurrent neural networks",
            "authors": "Federico A. Galatolo, Mario G. C. A. Cimino, Gigliola Vaglini",
            "date": {
                "day": 19,
                "month": 1,
                "year": 2019
            },
            "type": "conference",
            "container": "ICPRAM",
            "keywords": ["artificial inteligence", "neural networks"],
            "afferences": ["unipi"],
            "volume" : "",
            "issue": "",
            "pages": "",
            "issn": "",
            "isbn": "",
            "doi": "",
            "link": "http://www.iet.unipi.it/m.cimino/publications/cimino_pub68.pdf",
            "abstract": "In this paper, a novel architecture of Recurrent Neural Network (RNN) is designed and experimented. The proposed RNN adopts a computational memory based on the concept of stigmergy. The basic principle of a Stigmergic Memory (SM) is that the activity of deposit/removal of a quantity in the SM stimulates the next activities of deposit/removal. Accordingly, subsequent SM activities tend to reinforce/weaken each other, generating a coherent coordination between the SM activities and the input temporal stimulus. We show that, in a problem of supervised classification, the SM encodes the temporal input in an emergent representational model, by coordinating the deposit, removal and classification activities. This study lays down a basic framework for the derivation of a SM-RNN. A formal ontology of SM is discussed, and the SM-RNN architecture is detailed. To appreciate the computational power of an SM-RNN, comparative NNs have been selected and trained to solve the MNIST handwritten digits recognition benchmark in its two variants: spatial (sequences of bitmap rows) and temporal (sequences of pen strokes).",
            "name": "galatolosm"
        }
    ],
    "projects":[
        {
            "title": "Slope",
            "description": "Super Light Objective Processor Emulator (aka slope) is a very light and simple virtual machine for an object-oriented processor. The entire project was realized for an university exam, so it is not complete or usable in real life.",
            "afferences": ["unipi", "school-project"],
            "date": {
                "day": 14,
                "month": 1,
                "year": 2017
            },
            "link": "https://github.com/galatolofederico/slope"
        },
        {
            "title": "Isaac Optimization Framework",
            "description": "Isaac was born with the intent to fill the gap between high level description capabilities of the modern programming languages and the optimizations algorithms. With isaac you can model your optimization problems using all the expressive power of Python",
            "afferences": ["research", "personal"],
            "date": {
                "day": 28,
                "month": 3,
                "year": 2018
            },
            "link": "https://github.com/galatolofederico/isaac-framework"
        },
        {
            "title": "Sacred Retrieve",
            "description": "Python script for easily retrieving and processing results from a sacred mongodb collection",
            "afferences": ["unipi", "research"],
            "date": {
                "day": 28,
                "month": 10,
                "year": 2018
            },
            "link": "https://github.com/galatolofederico/sacred-retrieve"
        },
        {
            "title": "torchsnn",
            "description": "pytorch implementation of the Stigmergic Neural Networks as presented in the paper Using stigmergy to incorporate the time into artificial neural networks.",
            "afferences": ["unipi", "research"],
            "date": {
                "day": 15,
                "month": 11,
                "year": 2018
            },
            "link": "https://github.com/galatolofederico/torchsnn"
        },
        {
            "title": "Pytorch MNIST Stroke",
            "description": "PyTorch helper Dataset class for downloading and parsing the MNIST digits stroke sequence data dataset.            ",
            "afferences": ["unipi", "research"],
            "date": {
                "day": 1,
                "month": 12,
                "year": 2018
            },
            "link": "https://github.com/galatolofederico/pytorch-mnist-stroke"
        },
        {
            "title": "dotfiles",
            "description": "Dotfiles for my Arch Linux meta-distribution",
            "afferences": ["linux", "personal"],
            "date": {
                "day": 24,
                "month": 12,
                "year": 2018
            },
            "link": "https://github.com/galatolofederico/dotfiles"
        },
        {
            "title": "torchsm",
            "description": "Pytorch implementation of the Stigmergic Memory as presented in the paper Using stigmergy as a computational memory in the design of recurrent neural networks.",
            "afferences": ["unipi", "research"],
            "date": {
                "day": 14,
                "month": 1,
                "year": 2019
            },
            "link": "https://github.com/galatolofederico/torchsm"
        },
        {
            "title": "torchreinforce",
            "description": "A pythonic implementation of the REINFORCE algorithm that is actually fun to use",
            "afferences": ["research", "personal"],
            "date": {
                "day": 20,
                "month": 1,
                "year": 2019
            },
            "link": "https://github.com/galatolofederico/torchreinforce"
        },
        {
            "title": "icpram2019",
            "description": "Implementation of the experiments proposed in the paper Using stigmergy as a computational memory in the design of recurrent neural networks.",
            "afferences": ["unipi", "research"],
            "date": {
                "day": 17,
                "month": 1,
                "year": 2019
            },
            "link": "https://github.com/galatolofederico/icpram2019"
        },
        {
            "title": "mike2018",
            "description": "Implementation of the experiments proposed in the paper Using stigmergy to incorporate the time into artificial neural networks.",
            "afferences": ["unipi", "research"],
            "date": {
                "day": 26,
                "month": 10,
                "year": 2018
            },
            "link": "https://github.com/galatolofederico/mike2018"
        },
        {
            "title": "Personal Site",
            "description": "Personal website realized with Angular 7 and Boostrap 4",
            "afferences": ["personal"],
            "date": {
                "day": 1,
                "month": 2,
                "year": 2019
            },
            "link": "https://github.com/galatolofederico/personal-site"
        }
    ],
    "education":[
    ]
}